# Investor - Flow of Funds - US

### Introduction:

Special thanks to: https://github.com/rgrp for sharing the dataset.

### Step 1. Import the necessary libraries

In [104]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/datasets/investor-flow-of-funds-us/master/data/weekly.csv).

### Step 3. Assign it to a variable called

In [105]:
url = 'https://raw.githubusercontent.com/datasets/investor-flow-of-funds-us/master/data/weekly.csv'
df = pd.read_csv(url)

### Step 4.  What is the frequency of the dataset?

In [106]:
frequency = (pd.to_datetime(df['Date'][1]) - pd.to_datetime(df['Date'][0]))
frequency

Timedelta('7 days 00:00:00')

### Step 5. Set the column Date as the index.

In [107]:
df.set_index('Date' , inplace=True)

### Step 6. What is the type of the index?

In [108]:
print(df.index.dtype)

object

### Step 7. Set the index to a DatetimeIndex type

In [109]:
df.index = pd.to_datetime(df.index)
print(df.index.dtype)

datetime64[ns]

### Step 8.  Change the frequency to monthly, sum the values and assign it to monthly.

In [110]:
monthly = df.groupby(df.index.month).sum()
monthly

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
1,7132,-2791,9923,4459,19517,12176,7341,31109
2,5508,3509,1999,1752,9099,7443,1656,16359
3,5691,-8176,13867,2829,9138,7267,1870,17657
4,11221,-3580,14801,5901,8916,7707,1209,26039
5,-2203,-8720,6518,3172,13767,10192,3576,14736
6,2319,-6546,8865,4588,9715,7551,2163,16621
7,-7051,-11128,4078,2666,7506,7026,481,3122
8,1943,-5508,7452,1885,1897,-1013,2910,5723
9,-2767,-6596,3829,1599,3984,2479,1504,2816
11,-2753,-7239,4485,729,14528,11566,2962,12502
12,-26156,-23126,-3031,526,9848,12613,-2765,-15782

### Step 9. You will notice that it filled the dataFrame with months that don't have any data with NaN. Let's drop these rows.

In [111]:
df = df.dropna()
df.head()

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
2012-12-05,-7426,-6060,-1367,-74,5317,4210,1107,-2183
2012-12-12,-8783,-7520,-1263,123,1818,1598,219,-6842
2012-12-19,-5496,-5470,-26,-73,103,3472,-3369,-5466
2012-12-26,-4451,-4076,-375,550,2610,3333,-722,-1291
2013-01-02,-11156,-9622,-1533,-158,2383,2103,280,-8931

### Step 10. Good, now we have the monthly data. Now change the frequency to year.

In [115]:
yearly = df.groupby(df.index.year).sum()
yearly

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
2012,-26156,-23126,-3031,526,9848,12613,-2765,-15782
2013,3661,-1627,5288,2730,12149,9414,2735,18540
2014,330,-44689,45021,19570,59890,44994,14896,79787
2015,15049,-10459,25508,7280,26028,17986,8041,48357

### BONUS: Create your own question and answer it.

In [118]:
#calculate the max, min, mean, and standard deviation of this dataset?

summary = df.describe().agg(['max', 'min', 'mean', 'std'])
summary

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
max,14817.000000,7995.000000,6821.000000,2888.000000,9766.000000,7311.000000,2455.000000,27471.000000
min,-11156.000000,-9622.000000,-1533.000000,-1057.000000,-8193.000000,-8658.000000,-3369.000000,-9040.000000
mean,1061.959296,-669.620579,1691.030928,667.819157,1793.888581,1173.952726,279.931370,4615.191393
std,7177.806266,5088.060747,2416.498205,1111.452073,4948.668621,4517.847862,1643.060716,10444.920825